OdDAI.Repository.hasModel(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves if model with model name already exists in repository.
returns True if model with same name is already exists in repository, otherwise returns false.

OdDAI.Repository.session
\details
Returns a pointer to session in which the repository was created.
\returns Returns pointer to the session.

OdDAI.Repository.writeStream(OdSmartPtr&lt;OdStreamBuf&gt;,System.Boolean)
\details
Writes data from the specified stream buffer to a physical file.
\param pStream      [in] A smart pointer to the output stream buffer object to wtite data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.
\remarks
This method does not support writing to Zip format.

OdDAI.Repository.writeFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Writes data from the repository object to a physical file.
\param filename     [in] A string that contains the full path to the output file to write data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns Returns eOk if the data was successfully written; otherwise, the method returns an appropriate error.

OdDAI.Repository.readStream(OdSmartPtr&lt;OdStreamBuf&gt;)
\details
Reads data from a specified stream buffer.
\param pStream [in] A smart pointer to the stream buffer object to read data from.
\returns Returns eOk if the data was successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details

OdDAI.Repository.getModelAccessMode(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get model access mode by model name.
\param modelName [in] model name
\returns model access mode

OdDAI.Repository.getModelRW(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get model in read only mode.
\param modelName [in] model name which should be open in read/write mode
\returns ModelPtr in read/write mode

OdDAI.Repository.getModel(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get model in read only mode.
\param modelPtr [in] model name which should be open in read only mode
\returns ModelPtr in read only mode

OdDAI.Repository.getModelRW(OdSmartPtr&lt;OdDAI.Model&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get model in read only mode.
\param modelPtr [in] model which should be open in read/write mode
\returns ModelPtr in read/write mode

OdDAI.Repository.getModel(OdSmartPtr&lt;OdDAI.Model&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get model in read only mode.
\param modelPtr [in] model which should be open in read only mode
\returns ModelPtr in read mode

OdDAI.Repository.createModel(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSmartPtr&lt;OdDAI.Schema&gt;!System.Runtime.CompilerServices.IsConst)
\details
Create a new model with name and schema in the repository.
\param name [in] name of created model
\param schema [in] schema of created model
\returns ModelPtr

OdDAI.Repository.createModel(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Create a new model with name and schema in the repository.
\param name [in] name of created model
\param schema [in] schema name of created model
\returns ModelPtr

OdDAI.Repository.name(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Assigns a name to the repository.

OdDAI.Repository.name
Retrieves the current name of repository.
\returns Returns a string that contains the name.